app/controllers/emails_controller.rb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @emails = Email.all
    @email = Email.find_by(id: params[:id])

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Mythopoeia"], ["body", "Postern of Fate"], ["created_at", "2020-03-05 18:41:07.823163"], ["updated_at", "2020-03-05 18:41:07.823163"]]
---
  def create
    @email = Email.new(object: Faker::Book.genre, body: Faker::Book.title)
   if @email.save